; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_13_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 - counter
	)
  (:init
		(= (value c0) 72)
	(= (value c1) 30)
	(= (value c2) 49)
	(= (value c3) 62)
	(= (value c4) 75)
	(= (value c5) 55)
	(= (value c6) 82)
	(= (value c7) 25)
	(= (value c8) 5)
	(= (value c9) 86)
	(= (value c10) 56)
	(= (value c11) 98)
	(= (value c12) 78)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
		)
	)
)

; plan
1. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 6 of 12
2. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 6 of 12
3. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 6 of 12
4. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 6 of 12
5. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 6 of 12
6. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 6 of 12
7. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 6 of 12
8. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 6 of 12
9. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 6 of 12
10. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 6 of 12
11. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 6 of 12
12. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 6 of 12
13. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 6 of 12
14. (increment c12)
   changed: (value c12) from 78 to 83
   goals met: 6 of 12
15. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 6 of 12
16. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 6 of 12
17. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 6 of 12
18. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 6 of 12
19. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 6 of 12
20. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 6 of 12
21. (increase_rate c8)
   changed: (rate_value c8) from 5 to 6
   goals met: 6 of 12
22. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 6 of 12
23. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 6 of 12
24. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 6 of 12
25. (increase_rate c8)
   changed: (rate_value c8) from 6 to 7
   goals met: 6 of 12
26. (increment c8)
   changed: (value c8) from 5 to 12
   goals met: 6 of 12
27. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 6 of 12
28. (increase_rate c5)
   changed: (rate_value c5) from 4 to 5
   goals met: 6 of 12
29. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 6 of 12
30. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 6 of 12
31. (increment c5)
   changed: (value c5) from 55 to 60
   goals met: 6 of 12
32. (increment c12)
   changed: (value c12) from 83 to 88
   goals met: 6 of 12
33. (increment c12)
   changed: (value c12) from 88 to 93
   goals met: 6 of 12
34. (increment c12)
   changed: (value c12) from 93 to 98
   goals met: 6 of 12
35. (decrement c11)
   changed: (value c11) from 98 to 96
   goals met: 7 of 12
36. (increment c8)
   changed: (value c8) from 12 to 19
   goals met: 7 of 12
37. (increment c8)
   changed: (value c8) from 19 to 26
   goals met: 8 of 12
38. (increment c5)
   changed: (value c5) from 60 to 65
   goals met: 8 of 12
39. (increment c5)
   changed: (value c5) from 65 to 70
   goals met: 8 of 12
40. (increment c5)
   changed: (value c5) from 70 to 75
   goals met: 8 of 12
41. (increment c5)
   changed: (value c5) from 75 to 80
   goals met: 9 of 12
42. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 9 of 12
43. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 9 of 12
44. (increment c7)
   changed: (value c7) from 25 to 34
   goals met: 8 of 12
45. (increment c8)
   changed: (value c8) from 26 to 33
   goals met: 8 of 12
46. (increment c8)
   changed: (value c8) from 33 to 40
   goals met: 9 of 12
47. (increment c7)
   changed: (value c7) from 34 to 43
   goals met: 8 of 12
48. (increment c7)
   changed: (value c7) from 43 to 52
   goals met: 8 of 12
49. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 8 of 12
50. (increment c7)
   changed: (value c7) from 52 to 62
   goals met: 8 of 12
51. (increment c8)
   changed: (value c8) from 40 to 47
   goals met: 8 of 12
52. (increase_rate c1)
   changed: (rate_value c1) from 0 to 1
   goals met: 8 of 12
53. (increase_rate c1)
   changed: (rate_value c1) from 1 to 2
   goals met: 8 of 12
54. (increase_rate c0)
   changed: (rate_value c0) from 0 to 1
   goals met: 8 of 12
55. (increase_rate c1)
   changed: (rate_value c1) from 2 to 3
   goals met: 8 of 12
56. (increase_rate c1)
   changed: (rate_value c1) from 3 to 4
   goals met: 8 of 12
57. (increase_rate c0)
   changed: (rate_value c0) from 1 to 2
   goals met: 8 of 12
58. (increase_rate c0)
   changed: (rate_value c0) from 2 to 3
   goals met: 8 of 12
59. (increase_rate c1)
   changed: (rate_value c1) from 4 to 5
   goals met: 8 of 12
60. (increase_rate c1)
   changed: (rate_value c1) from 5 to 6
   goals met: 8 of 12
61. (increase_rate c1)
   changed: (rate_value c1) from 6 to 7
   goals met: 8 of 12
62. (increment c1)
   changed: (value c1) from 30 to 37
   goals met: 8 of 12
63. (increment c1)
   changed: (value c1) from 37 to 44
   goals met: 8 of 12
64. (increment c1)
   changed: (value c1) from 44 to 51
   goals met: 7 of 12
65. (increase_rate c1)
   changed: (rate_value c1) from 7 to 8
   goals met: 7 of 12
66. (increase_rate c1)
   changed: (rate_value c1) from 8 to 9
   goals met: 7 of 12
67. (increase_rate c1)
   changed: (rate_value c1) from 9 to 10
   goals met: 7 of 12
68. (increase_rate c0)
   changed: (rate_value c0) from 3 to 4
   goals met: 7 of 12
69. (decrement c1)
   changed: (value c1) from 51 to 41
   goals met: 8 of 12
70. (decrement c0)
   changed: (value c0) from 72 to 68
   goals met: 8 of 12
71. (increment c1)
   changed: (value c1) from 41 to 51
   goals met: 7 of 12
72. (decrement c0)
   changed: (value c0) from 68 to 64
   goals met: 7 of 12
73. (increment c8)
   changed: (value c8) from 47 to 54
   goals met: 7 of 12
74. (increment c8)
   changed: (value c8) from 54 to 61
   goals met: 7 of 12
75. (increment c8)
   changed: (value c8) from 61 to 68
   goals met: 8 of 12
76. (increment c7)
   changed: (value c7) from 62 to 72
   goals met: 7 of 12
77. (increment c7)
   changed: (value c7) from 72 to 82
   goals met: 7 of 12
78. (increment c8)
   changed: (value c8) from 68 to 75
   goals met: 7 of 12
79. (increment c8)
   changed: (value c8) from 75 to 82
   goals met: 7 of 12
80. (increment c8)
   changed: (value c8) from 82 to 89
   goals met: 7 of 12
81. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 7 of 12
82. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 7 of 12
83. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 7 of 12
84. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 7 of 12
85. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 7 of 12
86. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 7 of 12
87. (increment c10)
   changed: (value c10) from 56 to 62
   goals met: 7 of 12
88. (increment c10)
   changed: (value c10) from 62 to 68
   goals met: 7 of 12
89. (increment c10)
   changed: (value c10) from 68 to 74
   goals met: 7 of 12
90. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 7 of 12
91. (increment c10)
   changed: (value c10) from 74 to 81
   goals met: 7 of 12
92. (increment c10)
   changed: (value c10) from 81 to 88
   goals met: 8 of 12
93. (decrement c1)
   changed: (value c1) from 51 to 41
   goals met: 9 of 12
94. (increase_rate c0)
   changed: (rate_value c0) from 4 to 5
   goals met: 9 of 12
95. (decrement c0)
   changed: (value c0) from 64 to 59
   goals met: 9 of 12
96. (decrement c0)
   changed: (value c0) from 59 to 54
   goals met: 9 of 12
97. (increment c1)
   changed: (value c1) from 41 to 51
   goals met: 8 of 12
98. (decrement c0)
   changed: (value c0) from 54 to 49
   goals met: 9 of 12
99. (decrement c1)
   changed: (value c1) from 51 to 41
   goals met: 9 of 12
100. (decrement c0)
   changed: (value c0) from 49 to 44
   goals met: 9 of 12
101. (decrement c0)
   changed: (value c0) from 44 to 39
   goals met: 10 of 12
102. (decrement c8)
   changed: (value c8) from 89 to 82
   goals met: 10 of 12
103. (decrement c7)
   changed: (value c7) from 82 to 72
   goals met: 11 of 12
104. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 11 of 12
105. (increment c7)
   changed: (value c7) from 72 to 82
   goals met: 10 of 12
106. (increment c8)
   changed: (value c8) from 82 to 89
   goals met: 10 of 12
107. (decrement c6)
   changed: (value c6) from 82 to 81
   goals met: 11 of 12
108. (decrement c8)
   changed: (value c8) from 89 to 82
   goals met: 11 of 12
109. (decrement c7)
   changed: (value c7) from 82 to 72
   goals met: 11 of 12
110. (decrement c6)
   changed: (value c6) from 81 to 80
   goals met: 10 of 12
111. (decrement c6)
   changed: (value c6) from 80 to 79
   goals met: 10 of 12
112. (decrement c6)
   changed: (value c6) from 79 to 78
   goals met: 10 of 12
113. (decrement c6)
   changed: (value c6) from 78 to 77
   goals met: 10 of 12
114. (decrement c6)
   changed: (value c6) from 77 to 76
   goals met: 10 of 12
115. (decrement c6)
   changed: (value c6) from 76 to 75
   goals met: 10 of 12
116. (decrement c6)
   changed: (value c6) from 75 to 74
   goals met: 10 of 12
117. (decrement c6)
   changed: (value c6) from 74 to 73
   goals met: 10 of 12
118. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 10 of 12
119. (decrement c6)
   changed: (value c6) from 73 to 71
   goals met: 11 of 12
120. (decrement c5)
   changed: (value c5) from 80 to 75
   goals met: 10 of 12
121. (decrement c5)
   changed: (value c5) from 75 to 70
   goals met: 11 of 12
122. (decrement c4)
   changed: (value c4) from 75 to 73
   goals met: 11 of 12
123. (decrement c4)
   changed: (value c4) from 73 to 71
   goals met: 11 of 12
124. (decrement c4)
   changed: (value c4) from 71 to 69
   goals met: 12 of 12
